examples_free_decay/3D_RM6_heave/mesh_4x/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"


    //These are for interFoam, use zero gradient for waves2foam
    inlet
    {
        type            waveVelocity;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            waveVelocity;	
        value           uniform (0 0 0);
    }

    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }

    bottom
    {
        type            slip;
    }

    "(baffle.*)"
    {
        type            cyclic;
    }

    "(object.*)"
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

}


// ************************************************************************* //
